       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAINPGM.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY customer.
       PROCEDURE DIVISION.
           DISPLAY "Start MAINPGM".
           MOVE 10001 TO CUST-ID.
           MOVE "John Doe" TO CUST-NAME.
           MOVE 1234.56 TO CUST-BALANCE.
           CALL "DBPROG" USING CUSTOMER-RECORD.
           CALL "HELLOPGM" USING CUSTOMER-RECORD.
           STOP RUN.
