       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBPGM.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY customer.
       PROCEDURE DIVISION USING CUSTOMER-RECORD.
           DISPLAY "SUBPGM received customer " CUST-ID.
           GOBACK.
